ActionSuccessVin.yml
config:
  variables:
    customMessage: "Action Success Vin"
  #target: 'https://core.dev.appservice.draiver.net'
  target: 'http://localhost:8080'
  processor: "./processor.js"
  http:
    timeout: 30 # Responses have to be sent within 30 seconds or the request will be aborted
    arrivalCount: 1
  defaults:
        headers:
            content-type: "application/json"
            accept: "application/json"
  payload:  
    path: "./tokens.csv"
    fields: 
      - "token"
  phases: 
    - duration: 1
      arrivalRate: 1
      name: Warm up
scenarios:
      - flow:
        - log: "Executing > Action Success Vin"  
        - post:
              url: "/action"   
              headers:
                authorization: "Bearer {{token}}" 
              json:       
                - referenceId: "foo"
                  externalIdentifier: "Optional non-unique string"
                  quoteId: "Optional provided id from Create Quote"
                  actionType: "MOVE_VEHICLES"
                  pickup:
                    point:
                      mapPointType: "ADDRESS"
                      street1: "60 Springview Place"
                      street2: null
                      city: "Newnan"
                      state: "GA"
                      postalCode: "30265"
                    windowUTC:
                      start: "2024-10-27T08:19:13Z"
                      end: "2024-10-27T14:19:13Z"
                    tasks:
                      - taskType: "TO_DO"
                        note: "JASON-foo"
                        noteMimeType: "TEXT_PLAIN"
                  dropoff:
                    point:
                      mapPointType: "ADDRESS"
                      street1: "185 GA-16"
                      street2: null
                      city: "Newnan"
                      state: "GA"
                      postalCode: "30263"
                    windowUTC:
                      start: "2024-10-27T12:19:13Z"
                      end: "2024-10-27T20:19:13Z"
                    tasks:
                      - taskType: "TO_DO"
                        note: "HOLA-foo"
                        noteMimeType: "TEXT_PLAIN"
                  vehicle:
                    vin: "1G1PA5SG0E7174385"
                  reason:
                    category: "RETAIL"
                    label: "Your label"
                  notes:
                    - noteType: "GENERAL"
                      message: "new notes"
                    - noteType: "PICKUP_INSTRUCTIONS"
                      message: "Use the second door"
                    - noteType: "DROPOFF_INSTRUCTIONS"
                      message: "leave keys in drop box"         
        afterResponse: "captureResponse" 
        beforeRequest: "logRequestBody"